MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKV58F512VMD24/mcu.h
/*! @name SEL17 - Crossbar A Select Register 17 */
/*! @{ */
#define XBARA_SEL17_SEL34_MASK                   (0x3FU)
#define XBARA_SEL17_SEL34_SHIFT                  (0U)
/*! SEL34
 *  0b000000..Logic zero
 *  0b000001..Logic one
 *  0b000010..XB_IN2 input pin
 *  0b000011..XB_IN3 input pin
 *  0b000100..XB_IN4 input pin
 *  0b000101..XB_IN5 input pin
 *  0b000110..XB_IN6 input pin
 *  0b000111..XB_IN7 input pin
 *  0b001000..XB_IN8 input pin
 *  0b001001..XB_IN9 input pin
 *  0b001010..XB_IN10 input pin
 *  0b001011..XB_IN11 input pin
 *  0b001100..CMP0 Output
 *  0b001101..CMP1 Output
 *  0b001110..CMP2 Output
 *  0b001111..CMP3 Output
 *  0b010000..FTM0 all channels match trigger ORed together
 *  0b010001..FTM0 counter init trigger
 *  0b010010..FTM3 all channels match trigger ORed together
 *  0b010011..FTM3 counter init trigger
 *  0b010100..PWMA channel 0 trigger 0
 *  0b010101..PWMA channel 0 trigger 1
 *  0b010110..PWMA channel 1 trigger 0
 *  0b010111..PWMA channel 1 trigger 1
 *  0b011000..PWMA channel 2 trigger 0
 *  0b011001..PWMA channel 2 trigger 1
 *  0b011010..PWMA channel 3 trigger 0
 *  0b011011..PWMA channel 3 trigger 1
 *  0b011100..PDB0 channel 1 output trigger
 *  0b011101..PDB0 channel 0 output trigger
 *  0b011110..PDB1 channel 1 output trigger
 *  0b011111..PDB1 channel 0 output trigger
 *  0b100000..High Speed Analog-to-Digital Converter 1 conversion A complete
 *  0b100001..High Speed Analog-to-Digital Converter 0 conversion A complete
 *  0b100010..High Speed Analog-to-Digital Converter 1 conversion B complete
 *  0b100011..High Speed Analog-to-Digital Converter 0 conversion B complete
 *  0b100100..FTM1 all channels match trigger ORed together
 *  0b100101..FTM1 counter init trigger
 *  0b100110..DMA channel 0 done
 *  0b100111..DMA channel 1 done
 *  0b101000..DMA channel 6 done
 *  0b101001..DMA channel 7 done
 *  0b101010..PIT trigger 0
 *  0b101011..PIT trigger 1
 *  0b101100..Analog-to-Digital Converter 0 conversion complete
 *  0b101101..ENC compare trigger and position match
 *  0b101110..AOI output 0
 *  0b101111..AOI output 1
 *  0b110000..AOI output 2
 *  0b110001..AOI output 3
 *  0b110010..PIT trigger 2
 *  0b110011..PIT trigger 3
 *  0b110100..PWMB channel 0 trigger 0 or trigger 1
 *  0b110101..PWMB channel 1 trigger 0 or trigger 1
 *  0b110110..PWMB channel 2 trigger 0 or trigger 1
 *  0b110111..PWMB channel 3 trigger 0 or trigger 1
 *  0b111000..FTM2 all channels match trigger ORed together
 *  0b111001..FTM2 counter init trigger
 */
#define XBARA_SEL17_SEL34(x)                     (((uint16_t)(((uint16_t)(x)) << XBARA_SEL17_SEL34_SHIFT)) & XBARA_SEL17_SEL34_MASK)
#define XBARA_SEL17_SEL35_MASK                   (0x3F00U)
#define XBARA_SEL17_SEL35_SHIFT                  (8U)
/*! SEL35
 *  0b000000..Logic zero
 *  0b000001..Logic one
 *  0b000010..XB_IN2 input pin
 *  0b000011..XB_IN3 input pin
 *  0b000100..XB_IN4 input pin
 *  0b000101..XB_IN5 input pin
 *  0b000110..XB_IN6 input pin
 *  0b000111..XB_IN7 input pin
 *  0b001000..XB_IN8 input pin
 *  0b001001..XB_IN9 input pin
 *  0b001010..XB_IN10 input pin
 *  0b001011..XB_IN11 input pin
 *  0b001100..CMP0 Output
 *  0b001101..CMP1 Output
 *  0b001110..CMP2 Output
 *  0b001111..CMP3 Output
 *  0b010000..FTM0 all channels match trigger ORed together
 *  0b010001..FTM0 counter init trigger
 *  0b010010..FTM3 all channels match trigger ORed together
 *  0b010011..FTM3 counter init trigger
 *  0b010100..PWMA channel 0 trigger 0
 *  0b010101..PWMA channel 0 trigger 1
 *  0b010110..PWMA channel 1 trigger 0
 *  0b010111..PWMA channel 1 trigger 1
 *  0b011000..PWMA channel 2 trigger 0
 *  0b011001..PWMA channel 2 trigger 1
 *  0b011010..PWMA channel 3 trigger 0
 *  0b011011..PWMA channel 3 trigger 1
 *  0b011100..PDB0 channel 1 output trigger
 *  0b011101..PDB0 channel 0 output trigger
 *  0b011110..PDB1 channel 1 output trigger
 *  0b011111..PDB1 channel 0 output trigger
 *  0b100000..High Speed Analog-to-Digital Converter 1 conversion A complete
 *  0b100001..High Speed Analog-to-Digital Converter 0 conversion A complete
 *  0b100010..High Speed Analog-to-Digital Converter 1 conversion B complete
 *  0b100011..High Speed Analog-to-Digital Converter 0 conversion B complete
 *  0b100100..FTM1 all channels match trigger ORed together
 *  0b100101..FTM1 counter init trigger
 *  0b100110..DMA channel 0 done
 *  0b100111..DMA channel 1 done
 *  0b101000..DMA channel 6 done
 *  0b101001..DMA channel 7 done
 *  0b101010..PIT trigger 0
 *  0b101011..PIT trigger 1
 *  0b101100..Analog-to-Digital Converter 0 conversion complete
 *  0b101101..ENC compare trigger and position match
 *  0b101110..AOI output 0
 *  0b101111..AOI output 1
 *  0b110000..AOI output 2
 *  0b110001..AOI output 3
 *  0b110010..PIT trigger 2
 *  0b110011..PIT trigger 3
 *  0b110100..PWMB channel 0 trigger 0 or trigger 1
 *  0b110101..PWMB channel 1 trigger 0 or trigger 1
 *  0b110110..PWMB channel 2 trigger 0 or trigger 1
 *  0b110111..PWMB channel 3 trigger 0 or trigger 1
 *  0b111000..FTM2 all channels match trigger ORed together
 *  0b111001..FTM2 counter init trigger
 */
#define XBARA_SEL17_SEL35(x)                     (((uint16_t)(((uint16_t)(x)) << XBARA_SEL17_SEL35_SHIFT)) & XBARA_SEL17_SEL35_MASK)
/*! @} */

/*! @name SEL18 - Crossbar A Select Register 18 */
/*! @{ */
#define XBARA_SEL18_SEL36_MASK                   (0x3FU)
#define XBARA_SEL18_SEL36_SHIFT                  (0U)
/*! SEL36
 *  0b000000..Logic zero
 *  0b000001..Logic one
 *  0b000010..XB_IN2 input pin
 *  0b000011..XB_IN3 input pin
 *  0b000100..XB_IN4 input pin
 *  0b000101..XB_IN5 input pin
 *  0b000110..XB_IN6 input pin
 *  0b000111..XB_IN7 input pin
 *  0b001000..XB_IN8 input pin
 *  0b001001..XB_IN9 input pin
 *  0b001010..XB_IN10 input pin
 *  0b001011..XB_IN11 input pin
 *  0b001100..CMP0 Output
 *  0b001101..CMP1 Output
 *  0b001110..CMP2 Output
 *  0b001111..CMP3 Output
 *  0b010000..FTM0 all channels match trigger ORed together
 *  0b010001..FTM0 counter init trigger
 *  0b010010..FTM3 all channels match trigger ORed together
 *  0b010011..FTM3 counter init trigger
 *  0b010100..PWMA channel 0 trigger 0
 *  0b010101..PWMA channel 0 trigger 1
 *  0b010110..PWMA channel 1 trigger 0
 *  0b010111..PWMA channel 1 trigger 1
 *  0b011000..PWMA channel 2 trigger 0
 *  0b011001..PWMA channel 2 trigger 1
 *  0b011010..PWMA channel 3 trigger 0
 *  0b011011..PWMA channel 3 trigger 1
 *  0b011100..PDB0 channel 1 output trigger
 *  0b011101..PDB0 channel 0 output trigger
 *  0b011110..PDB1 channel 1 output trigger
 *  0b011111..PDB1 channel 0 output trigger
 *  0b100000..High Speed Analog-to-Digital Converter 1 conversion A complete
 *  0b100001..High Speed Analog-to-Digital Converter 0 conversion A complete
 *  0b100010..High Speed Analog-to-Digital Converter 1 conversion B complete
 *  0b100011..High Speed Analog-to-Digital Converter 0 conversion B complete
 *  0b100100..FTM1 all channels match trigger ORed together
 *  0b100101..FTM1 counter init trigger
 *  0b100110..DMA channel 0 done
 *  0b100111..DMA channel 1 done
 *  0b101000..DMA channel 6 done
 *  0b101001..DMA channel 7 done
 *  0b101010..PIT trigger 0
 *  0b101011..PIT trigger 1
 *  0b101100..Analog-to-Digital Converter 0 conversion complete
 *  0b101101..ENC compare trigger and position match
 *  0b101110..AOI output 0
 *  0b101111..AOI output 1
 *  0b110000..AOI output 2
 *  0b110001..AOI output 3
 *  0b110010..PIT trigger 2
 *  0b110011..PIT trigger 3
 *  0b110100..PWMB channel 0 trigger 0 or trigger 1
 *  0b110101..PWMB channel 1 trigger 0 or trigger 1
 *  0b110110..PWMB channel 2 trigger 0 or trigger 1
 *  0b110111..PWMB channel 3 trigger 0 or trigger 1
 *  0b111000..FTM2 all channels match trigger ORed together
 *  0b111001..FTM2 counter init trigger
 */
#define XBARA_SEL18_SEL36(x)                     (((uint16_t)(((uint16_t)(x)) << XBARA_SEL18_SEL36_SHIFT)) & XBARA_SEL18_SEL36_MASK)
#define XBARA_SEL18_SEL37_MASK                   (0x3F00U)
#define XBARA_SEL18_SEL37_SHIFT                  (8U)
/*! SEL37
 *  0b000000..Logic zero
 *  0b000001..Logic one
 *  0b000010..XB_IN2 input pin
 *  0b000011..XB_IN3 input pin
 *  0b000100..XB_IN4 input pin
 *  0b000101..XB_IN5 input pin
 *  0b000110..XB_IN6 input pin
 *  0b000111..XB_IN7 input pin
 *  0b001000..XB_IN8 input pin
 *  0b001001..XB_IN9 input pin
 *  0b001010..XB_IN10 input pin
 *  0b001011..XB_IN11 input pin
 *  0b001100..CMP0 Output
 *  0b001101..CMP1 Output
 *  0b001110..CMP2 Output
 *  0b001111..CMP3 Output
 *  0b010000..FTM0 all channels match trigger ORed together
 *  0b010001..FTM0 counter init trigger
 *  0b010010..FTM3 all channels match trigger ORed together
 *  0b010011..FTM3 counter init trigger
 *  0b010100..PWMA channel 0 trigger 0
 *  0b010101..PWMA channel 0 trigger 1
 *  0b010110..PWMA channel 1 trigger 0
 *  0b010111..PWMA channel 1 trigger 1
 *  0b011000..PWMA channel 2 trigger 0
 *  0b011001..PWMA channel 2 trigger 1
 *  0b011010..PWMA channel 3 trigger 0
 *  0b011011..PWMA channel 3 trigger 1
 *  0b011100..PDB0 channel 1 output trigger
 *  0b011101..PDB0 channel 0 output trigger
 *  0b011110..PDB1 channel 1 output trigger
 *  0b011111..PDB1 channel 0 output trigger
 *  0b100000..High Speed Analog-to-Digital Converter 1 conversion A complete
 *  0b100001..High Speed Analog-to-Digital Converter 0 conversion A complete
 *  0b100010..High Speed Analog-to-Digital Converter 1 conversion B complete
 *  0b100011..High Speed Analog-to-Digital Converter 0 conversion B complete
 *  0b100100..FTM1 all channels match trigger ORed together
 *  0b100101..FTM1 counter init trigger
 *  0b100110..DMA channel 0 done
 *  0b100111..DMA channel 1 done
 *  0b101000..DMA channel 6 done
 *  0b101001..DMA channel 7 done
 *  0b101010..PIT trigger 0
 *  0b101011..PIT trigger 1
 *  0b101100..Analog-to-Digital Converter 0 conversion complete
 *  0b101101..ENC compare trigger and position match
 *  0b101110..AOI output 0
 *  0b101111..AOI output 1
 *  0b110000..AOI output 2
 *  0b110001..AOI output 3
 *  0b110010..PIT trigger 2
 *  0b110011..PIT trigger 3
 *  0b110100..PWMB channel 0 trigger 0 or trigger 1
 *  0b110101..PWMB channel 1 trigger 0 or trigger 1
 *  0b110110..PWMB channel 2 trigger 0 or trigger 1
 *  0b110111..PWMB channel 3 trigger 0 or trigger 1
 *  0b111000..FTM2 all channels match trigger ORed together
 *  0b111001..FTM2 counter init trigger
 */
#define XBARA_SEL18_SEL37(x)                     (((uint16_t)(((uint16_t)(x)) << XBARA_SEL18_SEL37_SHIFT)) & XBARA_SEL18_SEL37_MASK)
/*! @} */

/*! @name SEL19 - Crossbar A Select Register 19 */
/*! @{ */
#define XBARA_SEL19_SEL38_MASK                   (0x3FU)
#define XBARA_SEL19_SEL38_SHIFT                  (0U)
/*! SEL38
 *  0b000000..Logic zero
 *  0b000001..Logic one
 *  0b000010..XB_IN2 input pin
 *  0b000011..XB_IN3 input pin
 *  0b000100..XB_IN4 input pin
 *  0b000101..XB_IN5 input pin
 *  0b000110..XB_IN6 input pin
 *  0b000111..XB_IN7 input pin
 *  0b001000..XB_IN8 input pin
 *  0b001001..XB_IN9 input pin
 *  0b001010..XB_IN10 input pin
 *  0b001011..XB_IN11 input pin
 *  0b001100..CMP0 Output
 *  0b001101..CMP1 Output
 *  0b001110..CMP2 Output
 *  0b001111..CMP3 Output
 *  0b010000..FTM0 all channels match trigger ORed together
 *  0b010001..FTM0 counter init trigger
 *  0b010010..FTM3 all channels match trigger ORed together
 *  0b010011..FTM3 counter init trigger
 *  0b010100..PWMA channel 0 trigger 0
 *  0b010101..PWMA channel 0 trigger 1
 *  0b010110..PWMA channel 1 trigger 0
 *  0b010111..PWMA channel 1 trigger 1
 *  0b011000..PWMA channel 2 trigger 0
 *  0b011001..PWMA channel 2 trigger 1
 *  0b011010..PWMA channel 3 trigger 0
 *  0b011011..PWMA channel 3 trigger 1
 *  0b011100..PDB0 channel 1 output trigger
 *  0b011101..PDB0 channel 0 output trigger
 *  0b011110..PDB1 channel 1 output trigger
 *  0b011111..PDB1 channel 0 output trigger
 *  0b100000..High Speed Analog-to-Digital Converter 1 conversion A complete
 *  0b100001..High Speed Analog-to-Digital Converter 0 conversion A complete
 *  0b100010..High Speed Analog-to-Digital Converter 1 conversion B complete
 *  0b100011..High Speed Analog-to-Digital Converter 0 conversion B complete
 *  0b100100..FTM1 all channels match trigger ORed together
 *  0b100101..FTM1 counter init trigger
 *  0b100110..DMA channel 0 done
 *  0b100111..DMA channel 1 done
 *  0b101000..DMA channel 6 done
 *  0b101001..DMA channel 7 done
 *  0b101010..PIT trigger 0
 *  0b101011..PIT trigger 1
 *  0b101100..Analog-to-Digital Converter 0 conversion complete
 *  0b101101..ENC compare trigger and position match
 *  0b101110..AOI output 0
 *  0b101111..AOI output 1
 *  0b110000..AOI output 2
 *  0b110001..AOI output 3
 *  0b110010..PIT trigger 2
 *  0b110011..PIT trigger 3
 *  0b110100..PWMB channel 0 trigger 0 or trigger 1
 *  0b110101..PWMB channel 1 trigger 0 or trigger 1
 *  0b110110..PWMB channel 2 trigger 0 or trigger 1
 *  0b110111..PWMB channel 3 trigger 0 or trigger 1
 *  0b111000..FTM2 all channels match trigger ORed together
 *  0b111001..FTM2 counter init trigger
 */
#define XBARA_SEL19_SEL38(x)                     (((uint16_t)(((uint16_t)(x)) << XBARA_SEL19_SEL38_SHIFT)) & XBARA_SEL19_SEL38_MASK)
#define XBARA_SEL19_SEL39_MASK                   (0x3F00U)
#define XBARA_SEL19_SEL39_SHIFT                  (8U)
/*! SEL39
 *  0b000000..Logic zero
 *  0b000001..Logic one
 *  0b000010..XB_IN2 input pin
 *  0b000011..XB_IN3 input pin
 *  0b000100..XB_IN4 input pin
 *  0b000101..XB_IN5 input pin
 *  0b000110..XB_IN6 input pin
 *  0b000111..XB_IN7 input pin
 *  0b001000..XB_IN8 input pin
 *  0b001001..XB_IN9 input pin
 *  0b001010..XB_IN10 input pin
 *  0b001011..XB_IN11 input pin
 *  0b001100..CMP0 Output
 *  0b001101..CMP1 Output
 *  0b001110..CMP2 Output
 *  0b001111..CMP3 Output
 *  0b010000..FTM0 all channels match trigger ORed together
 *  0b010001..FTM0 counter init trigger
 *  0b010010..FTM3 all channels match trigger ORed together
 *  0b010011..FTM3 counter init trigger
 *  0b010100..PWMA channel 0 trigger 0
 *  0b010101..PWMA channel 0 trigger 1
 *  0b010110..PWMA channel 1 trigger 0
 *  0b010111..PWMA channel 1 trigger 1
 *  0b011000..PWMA channel 2 trigger 0
 *  0b011001..PWMA channel 2 trigger 1
 *  0b011010..PWMA channel 3 trigger 0
 *  0b011011..PWMA channel 3 trigger 1
 *  0b011100..PDB0 channel 1 output trigger
 *  0b011101..PDB0 channel 0 output trigger
 *  0b011110..PDB1 channel 1 output trigger
 *  0b011111..PDB1 channel 0 output trigger
 *  0b100000..High Speed Analog-to-Digital Converter 1 conversion A complete
 *  0b100001..High Speed Analog-to-Digital Converter 0 conversion A complete
 *  0b100010..High Speed Analog-to-Digital Converter 1 conversion B complete
 *  0b100011..High Speed Analog-to-Digital Converter 0 conversion B complete
 *  0b100100..FTM1 all channels match trigger ORed together
 *  0b100101..FTM1 counter init trigger
 *  0b100110..DMA channel 0 done
 *  0b100111..DMA channel 1 done
 *  0b101000..DMA channel 6 done
 *  0b101001..DMA channel 7 done
 *  0b101010..PIT trigger 0
 *  0b101011..PIT trigger 1
 *  0b101100..Analog-to-Digital Converter 0 conversion complete
 *  0b101101..ENC compare trigger and position match
 *  0b101110..AOI output 0
 *  0b101111..AOI output 1
 *  0b110000..AOI output 2
 *  0b110001..AOI output 3
 *  0b110010..PIT trigger 2
 *  0b110011..PIT trigger 3
 *  0b110100..PWMB channel 0 trigger 0 or trigger 1
 *  0b110101..PWMB channel 1 trigger 0 or trigger 1
 *  0b110110..PWMB channel 2 trigger 0 or trigger 1
 *  0b110111..PWMB channel 3 trigger 0 or trigger 1
 *  0b111000..FTM2 all channels match trigger ORed together
 *  0b111001..FTM2 counter init trigger
 */
#define XBARA_SEL19_SEL39(x)                     (((uint16_t)(((uint16_t)(x)) << XBARA_SEL19_SEL39_SHIFT)) & XBARA_SEL19_SEL39_MASK)
/*! @} */

